#!/usr/bin/python3
# -*- coding: utf-8 -*-


# ---我的练习---
# 题目1：
# 输入3个数字，输出最大值
# a = input("请输入数字a:")
# b = input("请输入数字b:")
# c = input("请输入数字c:")
# l = [int(a),int(b),int(c)]
# for i in range(2):
#     if l[i] > l[i + 1]:
#         l[i], l[i + 1] = l[i + 1], l[i]
# print("最大值是：{}".format(l[-1]))
# 结果：
# 请输入数字a:12
# 请输入数字b:33
# 请输入数字c:56
# 最大值是：56

# 联想冒泡排序-升序
l = [2,12,68,45,99,6,32,888]
for n in range(1,len(l)):
    for i in range(1,len(l)-n):
        if l[i] > l[i + 1]:
            l[i], l[i + 1] = l[i + 1], l[i]
print(l)

# 分析：（从循环1开始）
# n  1,len(l)-1  +1-->len(l)
# n=1  i=1,len(l)-1
# n=2  i=1,len(l)-2
# n=3  i=1,len(1)-3-->len(l)-n  # 有点问题？

# 结果：
# [2, 6, 12, 32, 45, 68, 99, 888]

# 题目2：
'''
判断是否为闰年
提示:
输入一个有效的年份（如：2019），判断是否为闰年
如果是闰年，则打印“2019年是闰年”；否则打印“2019年不是闰年”
普通年能被4整除且不能被100整除的为闰年
世纪年能被400整除的是闰年
'''
year = input("请输入年份：")
year = int(year)
if (year%4==0 and year%100!=0) or year%400==0:
    print("{}是闰年".format(year))
else:
    print("{}不是闰年".format(year))

'''
题目3：99乘法表
1*1=1
1*2=2 2*2=4
1*3=3 2*3=6 3*3=9
。。。
'''
# 分析：
# 行i：1-9
# 列j：i列
# 第1行1列  1*1
# 第2行1列  1*2  第2行2列 2*2
# 第3行1列  1*3  第3行2列 2*3  第3行3列 3*3
for i in range(1,10):
    for j in range(1,i+1):
        print("{}*{}={}".format(j,i,i*j),end=' ')
    print("")

'''
结果：
1*1=1 
1*2=2 2*2=4 
1*3=3 2*3=6 3*3=9 
1*4=4 2*4=8 3*4=12 4*4=16 
1*5=5 2*5=10 3*5=15 4*5=20 5*5=25 
1*6=6 2*6=12 3*6=18 4*6=24 5*6=30 6*6=36 
1*7=7 2*7=14 3*7=21 4*7=28 5*7=35 6*7=42 7*7=49 
1*8=8 2*8=16 3*8=24 4*8=32 5*8=40 6*8=48 7*8=56 8*8=64 
1*9=9 2*9=18 3*9=27 4*9=36 5*9=45 6*9=54 7*9=63 8*9=72 9*9=81 

'''

# 用while实现
i = 1
while i<=9:
    j = 1
    while j<=i:
        print("{}*{}={}".format(j,i,i*j),end=' ')
        j += 1
    print()
    i += 1


